app/controllers/api1/users_controller.rb

	def bet_info
		user = User.find_by_facebook_id(params[:user])
		if user
			bets = (user.bets + user.dared_bets).uniq
			json = []
			bets.each_with_index do |bet, i|
				json[i] = {
					dared_user_id: bet.dared_user.facebook_id,
					start_date: bet.start_date.to_formatted_s(:db),
					end_date: bet.end_date.to_formatted_s(:db),
					description: bet.description ,
					prize: bet.prize,
					user_url: bet.user_url,
					dared_user_url: bet.dared_user_url
				}
			end
			render json: json.to_json
		elsif
			user = {facebook_id: params[:user]}
			User.create!(user)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`facebook_id` = '10202404085938250' LIMIT 1
INSERT INTO `users` (`created_at`, `facebook_id`, `updated_at`) VALUES ('2014-12-08 15:44:54', '1020240408593825', '2014-12-08 15:44:54')

	def create_bet
		facebook_token = params[:facebook_token]
		if facebook_token
			uri = URI.parse('https://graph.facebook.com/me?fields=id&access_token='+facebook_token)
			response = nil;
			Net::HTTP.start(uri.host, uri.port, :use_ssl => uri.scheme == 'https') do |http|
				request = Net::HTTP::Get.new uri
				response = http.request request # Net::HTTPResponse object
			end
			if User.find_by_facebook_id(params["user"]).nil?
				user = {facebook_id: params[:user]}
				User.create!(user)
			end
			if (JSON.parse(response.body)["id"] == params["user"])
				bet = {}
				bet["description"] = params["description"]
				bet["prize"] = params["description"]
				bet["user_url"] = params["user_url"]
				bet["dared_user_url"] = params["dared_user_url"]
				bet["start_date"] =  DateTime.parse params["start_date"]
				bet["end_date"] =  DateTime.parse params["end_date"]
				bet["user_id"] = User.find_by_facebook_id(params["user"]).id
				bet["dared_user_id"] = User.find_by_facebook_id(params["dared_user"]).id
				if Bet.create bet
---
SELECT  `users`.* FROM `users`  WHERE `users`.`facebook_id` = '10202404085938250' LIMIT 1
INSERT INTO `bets` (`dared_user_id`, `dared_user_url`, `description`, `end_date`, `prize`, `start_date`, `user_id`, `user_url`) VALUES (1, 'video2.com', 'Description test', '2014-12-07 07:19:38', 'Prize test', '2014-12-07 02:19:38', 1, 'video1.com')