app/controllers/api1/users_controller.rb

	def bet_info
		user = User.find_by_email(params[:user])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'teste@teste.com' LIMIT 1

	def create_bet
		facebook_token = params[:facebook_token]
		if facebook_token
			uri = URI.parse('https://graph.facebook.com/me?fields=id&access_token='+facebook_token)
			response = nil;
			Net::HTTP.start(uri.host, uri.port, :use_ssl => uri.scheme == 'https') do |http|
				request = Net::HTTP::Get.new uri
				response = http.request request # Net::HTTPResponse object
			end
			if JSON.parse(response.body)["id"]
				bet = params["bet"]
				bet["user_id"] = User.find_by_email(params["user"]).id
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'teste@teste.com' LIMIT 1